# Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме:
# название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
# Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджеры контекста.
from json import dumps
profit = [{}, {}]

with open('Task_7.txt', 'r') as f:
    lines = f.readlines()

for line in lines:
    name, t_ownership, revenue, costs = line.split()
    profit[0][name] = int(revenue) - int(costs)
    av_profit = [el for el in profit[0].values() if el > 0]
profit[1]['average profit'] = sum(av_profit) / len(av_profit)

with open('Task_7.json', 'w') as f:
    f.write(dumps(profit))
