# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

GDP = 106.607
country = 'России'
year = 2020

print(f'Номинальный объем ВВП {country} в {year} сосставил {GDP} трлн руб.')

name = input('Как вас зовут? ')
city = input('Где вы живете? ')
age = input('Сколько Вам лет? ')

print(f'Привет, {name}! Вам нравится {city}? {age} хороший возраст,'
      f'чтобы изучить что-нибудь новое, присоединяйтесь!')
